# Создать 2 списка, расширить, вставить эллемент, выводить на экран
one = ["Hello", "Freem", "Good"]
print(one)
two = ["Hi", "Man", "Type"]
print(two)
one.extend(two)
print(one)
one.insert(5, 123)
print(one)